test/script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://fev6jm4al9.execute-api.us-east-1.amazonaws.com"
  phases:
    -
      duration: 5
      arrivalRate: 2
  plugins:
    aws-sigv4:
      serviceName: execute-api
  payload:
    path: info.csv
    fields:
      - info
      - value
scenarios:
  -
    beforeRequest: addAmazonSignatureV4
    flow:
      - log: "info: {{ info }}, value: {{ value }}"
      - get:
          url: "/dev/testing?info={{info }}&value={{  value   }}"
          #url: "/dev/testing"